@rawmind0: I tried again, still the same result:

1. Completely remove the old local repo
2. `git clone https://github.com/rawmind0/terraform-provider-rancher2.git`
3. `git checkout app` (check again, your 2 new commits are there)
4. Build and copy the binare into ~/.terraform.d/plugins
5. Remove .terraform dir and rerun `terraform init`
6. The output with the error:

```
Terraform will perform the following actions:

  # module.logging.rancher2_app.kibana will be created
  + resource "rancher2_app" "kibana" {
      + annotations      = (known after apply)
      + catalog_name     = "local:elastic"
      + description      = "Kibana is an open source data visualization dashboard for Elasticsearch."
      + external_id      = (known after apply)
      + force_upgrade    = false
      + id               = (known after apply)
      + labels           = (known after apply)
      + name             = "kibana"
      + project_id       = "local:p-rcqlh"
      + revision_id      = (known after apply)
      + target_namespace = "logging"
      + template_name    = "kibana"
      + template_version = "7.6.2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.logging.rancher2_app.kibana: Creating...

Error: Bad response statusCode [500]. Status [500 Internal Server Error]. Body: [code=ServerError, message=catalogtemplateversions.management.cattle.io "elastic-kibana-7.6.2" not found, baseType=error] from [https://my-rancher.io/v3/project/local:p-rcqlh/apps]
```